ghi-electronics/TinyCLR-Ports/Targets/LPC17/LPC17_USB.cpp
            // If the port is configured, then output any possible withheld data
            if (result == USB_STATE_CONFIGURATION) {
                for (int ep = 0; ep < c_Used_Endpoints; ep++) {
                    if (State->IsTxQueue[ep])
                        StartOutput(State, ep);
                }
            }
        }
    }
    else if (in)//(EP_INTR & LPC17xx_USB::UDCICR__PCKT) && (USB.UDCCSRx[0] & (LPC17xx_USB::UDCCSR__IPR | LPC17xx_USB::UDCCSR__SST)) == 0)
    {
        // If previous packet has been sent and UDC is ready for more
        ControlNext();      // See if there is more to send
        if (USB_DeviceAddress & 0x80) {
            USB_DeviceAddress &= 0x7F;
            USB_SetAddress(USB_DeviceAddress);
        }
    }
    else {
        // This is for usb CDC
    }

}

void LPC17xx_USB_Driver::EP_TxISR(uint32_t endpoint) {
    ASSERT_IRQ_MUST_BE_OFF();

    uint32_t EP_INTR;
    int val;

    if (USBEpIntSt & (1 << EPAdr(endpoint, 1)))//done sending?
    {
        //clear interrupt flag
        USBEpIntClr = 1 << EPAdr(endpoint, 1);
        while ((USBDevIntSt & CDFULL_INT) == 0);
        val = USBCmdData;

        // successfully transmitted packet, time to send the next one
        TxPacket(g_LPC17xx_USB_Driver.pUsbControllerState, endpoint);
    }

}

void LPC17xx_USB_Driver::EP_RxISR(uint32_t endpoint) {
    bool          DisableRx;
    USB_PACKET64* Packet64 = LPC17_UsbClient_RxEnqueue(g_LPC17xx_USB_Driver.pUsbControllerState, endpoint, DisableRx);

    /* copy packet in, making sure that Packet64->Buffer is never overflowed */
    if (Packet64) {
        uint8_t   len = 0;//USB.UDCBCRx[EPno] & LPC17xx_USB::UDCBCR_mask;
        uint32_t* packetBuffer = (uint32_t*)Packet64->Buffer;
        len = USB_ReadEP(endpoint, Packet64->Buffer);

        // clear packet status
        nacking_rx_OUT_data[endpoint] = 0;
        Packet64->Size = len;
    }
    else {
        /* flow control should absolutely protect us from ever
        getting here, so if we do, it is a bug */
        nacking_rx_OUT_data[endpoint] = 1;//we will need to triger next interrupt

    }

}

void LPC17xx_USB_Driver::SuspendEvent() {
    //LPC17xx_USB& USB = LPC17xx::USB();
    USB_CONTROLLER_STATE *State = g_LPC17xx_USB_Driver.pUsbControllerState;

    // SUSPEND event only happened when Host(PC) set the device to SUSPEND
    // as there is always SOF every 1ms on the BUS to keep the device from
    // suspending. Therefore, the REMOTE wake up is not necessary at the ollie side

    g_LPC17xx_USB_Driver.PreviousDeviceState = State->DeviceState;

    State->DeviceState = USB_DEVICE_STATE_SUSPENDED;

    LPC17_UsbClient_StateCallback(State);
}


void LPC17xx_USB_Driver::ResumeEvent() {
    USB_CONTROLLER_STATE *State = g_LPC17xx_USB_Driver.pUsbControllerState;

    State->DeviceState = g_LPC17xx_USB_Driver.PreviousDeviceState;

    LPC17_UsbClient_StateCallback(State);

}



void LPC17xx_USB_Driver::ResetEvent() {
    USB_CONTROLLER_STATE *State = g_LPC17xx_USB_Driver.pUsbControllerState;

    USB_Reset();
    USB_DeviceAddress = 0;

    // clear all flags
    UsbClient_Driver::ClearEvent(0, 0xFFFFFFFF);

    for (int ep = 0; ep < c_Used_Endpoints; ep++) {
        g_LPC17xx_USB_Driver.TxRunning[ep] = false;
        g_LPC17xx_USB_Driver.TxNeedZLPS[ep] = false;
    }

    State->DeviceState = USB_DEVICE_STATE_DEFAULT;
    State->Address = 0;
    LPC17_UsbClient_StateCallback(State);

}

//--//

bool LPC17xx_USB_Driver::RxEnable(USB_CONTROLLER_STATE *State, int endpoint) {
    if (nullptr == State || endpoint >= c_Used_Endpoints)
        return false;

    GLOBAL_LOCK(irq);

    if (nacking_rx_OUT_data[endpoint])
        EP_RxISR(endpoint);//force interrupt to read the pending EP

    return true;
}

bool LPC17xx_USB_Driver::ProtectPins(int Controller, bool On) {
    USB_CONTROLLER_STATE *State = g_LPC17xx_USB_Driver.pUsbControllerState;

    GLOBAL_LOCK(irq);

    // Initialized yet?
    if (State) {
        if (On) {
            if (!g_LPC17xx_USB_Driver.PinsProtected) {
                // Disable the USB com, state change from Not protected to Protected
                g_LPC17xx_USB_Driver.PinsProtected = true;

                USB_Reset();
                USB_DeviceAddress = 0;

                StopHardware();
            }
        }
        else {
            if (g_LPC17xx_USB_Driver.PinsProtected) {
                // Ready for USB to enable, state change from Protected to Not protected
                g_LPC17xx_USB_Driver.PinsProtected = false;

                // enable the clock,
                // set USB to attached/powered
                // set the device to a known state- Attached before it is set to the powered state (USB specf 9.1.1)
                //CPU_GPIO_EnableInputPin(LPC17xx_USB::c_USBC_GPION_DET, false, nullptr, GPIO_INT_NONE, RESISTOR_DISABLED);
                //CPU_GPIO_EnableOutputPin(LPC17xx_USB::c_USBC_GPIOX_EN, false);       // Don't signal the host yet
                State->DeviceState = USB_DEVICE_STATE_ATTACHED;

                LPC17_UsbClient_StateCallback(State);

                StartHardware();
            }
        }

        return true;
    }
    else {
        return false;
    }
}

